###############################################################################
# Created by write_sdc
###############################################################################
current_design user_project_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {HCLK}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 2.2200 [get_clocks {clk}]
set_clock_latency -source -max 4.8500 [get_clocks {clk}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[0]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[0]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[10]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[10]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[11]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[11]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[12]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[12]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[13]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[13]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[14]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[14]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[15]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[15]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[16]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[16]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[17]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[17]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[18]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[18]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[19]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[19]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[1]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[1]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[20]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[20]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[21]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[21]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[22]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[22]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[23]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[23]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[24]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[24]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[25]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[25]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[26]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[26]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[27]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[27]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[28]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[28]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[29]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[29]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[2]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[2]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[30]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[30]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[31]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[31]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[3]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[3]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[4]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[4]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[5]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[5]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[6]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[6]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[7]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[7]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[8]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[8]}]
set_input_delay 0.7000 -clock [get_clocks {clk}] -min -add_delay [get_ports {HADDR[9]}]
set_input_delay 12.1200 -clock [get_clocks {clk}] -max -add_delay [get_ports {HADDR[9]}]
set_input_delay 1.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {HREADY}]
set_input_delay 4.5800 -clock [get_clocks {clk}] -max -add_delay [get_ports {HREADY}]
set_input_delay 2.3300 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRESETn}]
set_input_delay 4.0100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRESETn}]
set_input_delay 0.8300 -clock [get_clocks {clk}] -min -add_delay [get_ports {HSIZE[0]}]
set_input_delay 11.7600 -clock [get_clocks {clk}] -max -add_delay [get_ports {HSIZE[0]}]
set_input_delay 0.8300 -clock [get_clocks {clk}] -min -add_delay [get_ports {HSIZE[1]}]
set_input_delay 11.7600 -clock [get_clocks {clk}] -max -add_delay [get_ports {HSIZE[1]}]
set_input_delay 0.8300 -clock [get_clocks {clk}] -min -add_delay [get_ports {HSIZE[2]}]
set_input_delay 11.7600 -clock [get_clocks {clk}] -max -add_delay [get_ports {HSIZE[2]}]
set_input_delay 0.8700 -clock [get_clocks {clk}] -min -add_delay [get_ports {HTRANS[0]}]
set_input_delay 10.3800 -clock [get_clocks {clk}] -max -add_delay [get_ports {HTRANS[0]}]
set_input_delay 0.8700 -clock [get_clocks {clk}] -min -add_delay [get_ports {HTRANS[1]}]
set_input_delay 10.3800 -clock [get_clocks {clk}] -max -add_delay [get_ports {HTRANS[1]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[0]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[0]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[10]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[10]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[11]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[11]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[12]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[12]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[13]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[13]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[14]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[14]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[15]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[15]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[16]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[16]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[17]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[17]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[18]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[18]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[19]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[19]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[1]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[1]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[20]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[20]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[21]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[21]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[22]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[22]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[23]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[23]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[24]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[24]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[25]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[25]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[26]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[26]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[27]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[27]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[28]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[28]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[29]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[29]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[2]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[2]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[30]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[30]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[31]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[31]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[3]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[3]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[4]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[4]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[5]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[5]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[6]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[6]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[7]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[7]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[8]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[8]}]
set_input_delay 1.0500 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWDATA[9]}]
set_input_delay 6.1100 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWDATA[9]}]
set_input_delay 0.6300 -clock [get_clocks {clk}] -min -add_delay [get_ports {HWRITE}]
set_input_delay 10.9700 -clock [get_clocks {clk}] -max -add_delay [get_ports {HWRITE}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[0]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[0]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[10]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[10]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[11]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[11]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[12]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[12]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[13]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[13]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[14]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[14]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[15]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[15]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[16]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[16]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[17]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[17]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[18]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[18]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[19]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[19]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[1]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[1]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[20]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[20]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[21]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[21]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[22]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[22]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[23]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[23]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[24]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[24]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[25]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[25]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[26]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[26]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[27]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[27]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[28]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[28]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[29]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[29]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[2]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[2]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[30]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[30]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[31]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[31]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[3]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[3]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[4]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[4]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[5]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[5]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[6]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[6]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[7]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[7]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[8]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[8]}]
set_output_delay 0.0100 -clock [get_clocks {clk}] -min -add_delay [get_ports {HRDATA[9]}]
set_output_delay 7.5400 -clock [get_clocks {clk}] -max -add_delay [get_ports {HRDATA[9]}]
set_output_delay 0.8300 -clock [get_clocks {clk}] -min -add_delay [get_ports {HREADYOUT}]
set_output_delay 9.8000 -clock [get_clocks {clk}] -max -add_delay [get_ports {HREADYOUT}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[0]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[0]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[10]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[10]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[11]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[11]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[12]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[12]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[13]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[13]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[14]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[14]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[15]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[15]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[1]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[1]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[2]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[2]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[3]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[3]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[4]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[4]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[5]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[5]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[6]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[6]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[7]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[7]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[8]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[8]}]
set_output_delay 0.3900 -clock [get_clocks {clk}] -min -add_delay [get_ports {user_irq[9]}]
set_output_delay 6.1900 -clock [get_clocks {clk}] -max -add_delay [get_ports {user_irq[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.2900 [get_ports {HREADYOUT}]
set_load -pin_load 0.2900 [get_ports {adc0}]
set_load -pin_load 0.2900 [get_ports {adc1}]
set_load -pin_load 0.2900 [get_ports {comp_n}]
set_load -pin_load 0.2900 [get_ports {comp_p}]
set_load -pin_load 0.2900 [get_ports {dac0}]
set_load -pin_load 0.2900 [get_ports {dac1}]
set_load -pin_load 0.2900 [get_ports {gpio3_0_analog}]
set_load -pin_load 0.2900 [get_ports {gpio3_1_analog}]
set_load -pin_load 0.2900 [get_ports {gpio3_2_analog}]
set_load -pin_load 0.2900 [get_ports {gpio3_3_analog}]
set_load -pin_load 0.2900 [get_ports {gpio3_4_analog}]
set_load -pin_load 0.2900 [get_ports {gpio3_5_analog}]
set_load -pin_load 0.2900 [get_ports {gpio3_6_analog}]
set_load -pin_load 0.2900 [get_ports {gpio3_7_analog}]
set_load -pin_load 0.2900 [get_ports {gpio4_0_analog}]
set_load -pin_load 0.2900 [get_ports {gpio4_1_analog}]
set_load -pin_load 0.2900 [get_ports {gpio4_2_analog}]
set_load -pin_load 0.2900 [get_ports {gpio4_3_analog}]
set_load -pin_load 0.2900 [get_ports {gpio4_4_analog}]
set_load -pin_load 0.2900 [get_ports {gpio4_5_analog}]
set_load -pin_load 0.2900 [get_ports {gpio4_6_analog}]
set_load -pin_load 0.2900 [get_ports {gpio4_7_analog}]
set_load -pin_load 0.2900 [get_ports {ibias100}]
set_load -pin_load 0.2900 [get_ports {ibias50}]
set_load -pin_load 0.2900 [get_ports {left_vref}]
set_load -pin_load 0.2900 [get_ports {right_vref}]
set_load -pin_load 0.2900 [get_ports {tempsense}]
set_load -pin_load 0.2900 [get_ports {ulpcomp_n}]
set_load -pin_load 0.2900 [get_ports {ulpcomp_p}]
set_load -pin_load 0.2900 [get_ports {vbgsc}]
set_load -pin_load 0.2900 [get_ports {vbgtc}]
set_load -pin_load 0.2900 [get_ports {vinref}]
set_load -pin_load 0.2900 [get_ports {voutref}]
set_load -pin_load 0.2900 [get_ports {HRDATA[31]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[30]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[29]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[28]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[27]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[26]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[25]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[24]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[23]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[22]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[21]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[20]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[19]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[18]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[17]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[16]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[15]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[14]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[13]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[12]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[11]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[10]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[9]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[8]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[7]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[6]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[5]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[4]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[3]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[2]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[1]}]
set_load -pin_load 0.2900 [get_ports {HRDATA[0]}]
set_load -pin_load 0.2900 [get_ports {gpio0_oeb[7]}]
set_load -pin_load 0.2900 [get_ports {gpio0_oeb[6]}]
set_load -pin_load 0.2900 [get_ports {gpio0_oeb[5]}]
set_load -pin_load 0.2900 [get_ports {gpio0_oeb[4]}]
set_load -pin_load 0.2900 [get_ports {gpio0_oeb[3]}]
set_load -pin_load 0.2900 [get_ports {gpio0_oeb[2]}]
set_load -pin_load 0.2900 [get_ports {gpio0_oeb[1]}]
set_load -pin_load 0.2900 [get_ports {gpio0_oeb[0]}]
set_load -pin_load 0.2900 [get_ports {gpio0_out[7]}]
set_load -pin_load 0.2900 [get_ports {gpio0_out[6]}]
set_load -pin_load 0.2900 [get_ports {gpio0_out[5]}]
set_load -pin_load 0.2900 [get_ports {gpio0_out[4]}]
set_load -pin_load 0.2900 [get_ports {gpio0_out[3]}]
set_load -pin_load 0.2900 [get_ports {gpio0_out[2]}]
set_load -pin_load 0.2900 [get_ports {gpio0_out[1]}]
set_load -pin_load 0.2900 [get_ports {gpio0_out[0]}]
set_load -pin_load 0.2900 [get_ports {gpio1_oeb[7]}]
set_load -pin_load 0.2900 [get_ports {gpio1_oeb[6]}]
set_load -pin_load 0.2900 [get_ports {gpio1_oeb[5]}]
set_load -pin_load 0.2900 [get_ports {gpio1_oeb[4]}]
set_load -pin_load 0.2900 [get_ports {gpio1_oeb[3]}]
set_load -pin_load 0.2900 [get_ports {gpio1_oeb[2]}]
set_load -pin_load 0.2900 [get_ports {gpio1_oeb[1]}]
set_load -pin_load 0.2900 [get_ports {gpio1_oeb[0]}]
set_load -pin_load 0.2900 [get_ports {gpio1_out[7]}]
set_load -pin_load 0.2900 [get_ports {gpio1_out[6]}]
set_load -pin_load 0.2900 [get_ports {gpio1_out[5]}]
set_load -pin_load 0.2900 [get_ports {gpio1_out[4]}]
set_load -pin_load 0.2900 [get_ports {gpio1_out[3]}]
set_load -pin_load 0.2900 [get_ports {gpio1_out[2]}]
set_load -pin_load 0.2900 [get_ports {gpio1_out[1]}]
set_load -pin_load 0.2900 [get_ports {gpio1_out[0]}]
set_load -pin_load 0.2900 [get_ports {gpio2_oeb[7]}]
set_load -pin_load 0.2900 [get_ports {gpio2_oeb[6]}]
set_load -pin_load 0.2900 [get_ports {gpio2_oeb[5]}]
set_load -pin_load 0.2900 [get_ports {gpio2_oeb[4]}]
set_load -pin_load 0.2900 [get_ports {gpio2_oeb[3]}]
set_load -pin_load 0.2900 [get_ports {gpio2_oeb[2]}]
set_load -pin_load 0.2900 [get_ports {gpio2_oeb[1]}]
set_load -pin_load 0.2900 [get_ports {gpio2_oeb[0]}]
set_load -pin_load 0.2900 [get_ports {gpio2_out[7]}]
set_load -pin_load 0.2900 [get_ports {gpio2_out[6]}]
set_load -pin_load 0.2900 [get_ports {gpio2_out[5]}]
set_load -pin_load 0.2900 [get_ports {gpio2_out[4]}]
set_load -pin_load 0.2900 [get_ports {gpio2_out[3]}]
set_load -pin_load 0.2900 [get_ports {gpio2_out[2]}]
set_load -pin_load 0.2900 [get_ports {gpio2_out[1]}]
set_load -pin_load 0.2900 [get_ports {gpio2_out[0]}]
set_load -pin_load 0.2900 [get_ports {gpio3_oeb[7]}]
set_load -pin_load 0.2900 [get_ports {gpio3_oeb[6]}]
set_load -pin_load 0.2900 [get_ports {gpio3_oeb[5]}]
set_load -pin_load 0.2900 [get_ports {gpio3_oeb[4]}]
set_load -pin_load 0.2900 [get_ports {gpio3_oeb[3]}]
set_load -pin_load 0.2900 [get_ports {gpio3_oeb[2]}]
set_load -pin_load 0.2900 [get_ports {gpio3_oeb[1]}]
set_load -pin_load 0.2900 [get_ports {gpio3_oeb[0]}]
set_load -pin_load 0.2900 [get_ports {gpio3_out[7]}]
set_load -pin_load 0.2900 [get_ports {gpio3_out[6]}]
set_load -pin_load 0.2900 [get_ports {gpio3_out[5]}]
set_load -pin_load 0.2900 [get_ports {gpio3_out[4]}]
set_load -pin_load 0.2900 [get_ports {gpio3_out[3]}]
set_load -pin_load 0.2900 [get_ports {gpio3_out[2]}]
set_load -pin_load 0.2900 [get_ports {gpio3_out[1]}]
set_load -pin_load 0.2900 [get_ports {gpio3_out[0]}]
set_load -pin_load 0.2900 [get_ports {gpio4_oeb[7]}]
set_load -pin_load 0.2900 [get_ports {gpio4_oeb[6]}]
set_load -pin_load 0.2900 [get_ports {gpio4_oeb[5]}]
set_load -pin_load 0.2900 [get_ports {gpio4_oeb[4]}]
set_load -pin_load 0.2900 [get_ports {gpio4_oeb[3]}]
set_load -pin_load 0.2900 [get_ports {gpio4_oeb[2]}]
set_load -pin_load 0.2900 [get_ports {gpio4_oeb[1]}]
set_load -pin_load 0.2900 [get_ports {gpio4_oeb[0]}]
set_load -pin_load 0.2900 [get_ports {gpio4_out[7]}]
set_load -pin_load 0.2900 [get_ports {gpio4_out[6]}]
set_load -pin_load 0.2900 [get_ports {gpio4_out[5]}]
set_load -pin_load 0.2900 [get_ports {gpio4_out[4]}]
set_load -pin_load 0.2900 [get_ports {gpio4_out[3]}]
set_load -pin_load 0.2900 [get_ports {gpio4_out[2]}]
set_load -pin_load 0.2900 [get_ports {gpio4_out[1]}]
set_load -pin_load 0.2900 [get_ports {gpio4_out[0]}]
set_load -pin_load 0.2900 [get_ports {gpio5_oeb[7]}]
set_load -pin_load 0.2900 [get_ports {gpio5_oeb[6]}]
set_load -pin_load 0.2900 [get_ports {gpio5_oeb[5]}]
set_load -pin_load 0.2900 [get_ports {gpio5_oeb[4]}]
set_load -pin_load 0.2900 [get_ports {gpio5_oeb[3]}]
set_load -pin_load 0.2900 [get_ports {gpio5_oeb[2]}]
set_load -pin_load 0.2900 [get_ports {gpio5_oeb[1]}]
set_load -pin_load 0.2900 [get_ports {gpio5_oeb[0]}]
set_load -pin_load 0.2900 [get_ports {gpio5_out[7]}]
set_load -pin_load 0.2900 [get_ports {gpio5_out[6]}]
set_load -pin_load 0.2900 [get_ports {gpio5_out[5]}]
set_load -pin_load 0.2900 [get_ports {gpio5_out[4]}]
set_load -pin_load 0.2900 [get_ports {gpio5_out[3]}]
set_load -pin_load 0.2900 [get_ports {gpio5_out[2]}]
set_load -pin_load 0.2900 [get_ports {gpio5_out[1]}]
set_load -pin_load 0.2900 [get_ports {gpio5_out[0]}]
set_load -pin_load 0.2900 [get_ports {gpio6_oeb[7]}]
set_load -pin_load 0.2900 [get_ports {gpio6_oeb[6]}]
set_load -pin_load 0.2900 [get_ports {gpio6_oeb[5]}]
set_load -pin_load 0.2900 [get_ports {gpio6_oeb[4]}]
set_load -pin_load 0.2900 [get_ports {gpio6_oeb[3]}]
set_load -pin_load 0.2900 [get_ports {gpio6_oeb[2]}]
set_load -pin_load 0.2900 [get_ports {gpio6_oeb[1]}]
set_load -pin_load 0.2900 [get_ports {gpio6_oeb[0]}]
set_load -pin_load 0.2900 [get_ports {gpio6_out[7]}]
set_load -pin_load 0.2900 [get_ports {gpio6_out[6]}]
set_load -pin_load 0.2900 [get_ports {gpio6_out[5]}]
set_load -pin_load 0.2900 [get_ports {gpio6_out[4]}]
set_load -pin_load 0.2900 [get_ports {gpio6_out[3]}]
set_load -pin_load 0.2900 [get_ports {gpio6_out[2]}]
set_load -pin_load 0.2900 [get_ports {gpio6_out[1]}]
set_load -pin_load 0.2900 [get_ports {gpio6_out[0]}]
set_load -pin_load 0.2900 [get_ports {gpio7_oeb[7]}]
set_load -pin_load 0.2900 [get_ports {gpio7_oeb[6]}]
set_load -pin_load 0.2900 [get_ports {gpio7_oeb[5]}]
set_load -pin_load 0.2900 [get_ports {gpio7_oeb[4]}]
set_load -pin_load 0.2900 [get_ports {gpio7_oeb[3]}]
set_load -pin_load 0.2900 [get_ports {gpio7_oeb[2]}]
set_load -pin_load 0.2900 [get_ports {gpio7_oeb[1]}]
set_load -pin_load 0.2900 [get_ports {gpio7_oeb[0]}]
set_load -pin_load 0.2900 [get_ports {gpio7_out[7]}]
set_load -pin_load 0.2900 [get_ports {gpio7_out[6]}]
set_load -pin_load 0.2900 [get_ports {gpio7_out[5]}]
set_load -pin_load 0.2900 [get_ports {gpio7_out[4]}]
set_load -pin_load 0.2900 [get_ports {gpio7_out[3]}]
set_load -pin_load 0.2900 [get_ports {gpio7_out[2]}]
set_load -pin_load 0.2900 [get_ports {gpio7_out[1]}]
set_load -pin_load 0.2900 [get_ports {gpio7_out[0]}]
set_load -pin_load 0.2900 [get_ports {sio_oeb[1]}]
set_load -pin_load 0.2900 [get_ports {sio_oeb[0]}]
set_load -pin_load 0.2900 [get_ports {sio_out[1]}]
set_load -pin_load 0.2900 [get_ports {sio_out[0]}]
set_load -pin_load 0.2900 [get_ports {user_irq[15]}]
set_load -pin_load 0.2900 [get_ports {user_irq[14]}]
set_load -pin_load 0.2900 [get_ports {user_irq[13]}]
set_load -pin_load 0.2900 [get_ports {user_irq[12]}]
set_load -pin_load 0.2900 [get_ports {user_irq[11]}]
set_load -pin_load 0.2900 [get_ports {user_irq[10]}]
set_load -pin_load 0.2900 [get_ports {user_irq[9]}]
set_load -pin_load 0.2900 [get_ports {user_irq[8]}]
set_load -pin_load 0.2900 [get_ports {user_irq[7]}]
set_load -pin_load 0.2900 [get_ports {user_irq[6]}]
set_load -pin_load 0.2900 [get_ports {user_irq[5]}]
set_load -pin_load 0.2900 [get_ports {user_irq[4]}]
set_load -pin_load 0.2900 [get_ports {user_irq[3]}]
set_load -pin_load 0.2900 [get_ports {user_irq[2]}]
set_load -pin_load 0.2900 [get_ports {user_irq[1]}]
set_load -pin_load 0.2900 [get_ports {user_irq[0]}]
set_input_transition 1.3700 [get_ports {HCLK}]
set_input_transition -min 0.2800 [get_ports {HREADY}]
set_input_transition -max 0.1300 [get_ports {HREADY}]
set_input_transition -min 0.2700 [get_ports {HRESETn}]
set_input_transition -max 0.6200 [get_ports {HRESETn}]
set_input_transition 0.2600 [get_ports {HWRITE}]
set_input_transition -min 0.0400 [get_ports {HADDR[31]}]
set_input_transition -max 0.6700 [get_ports {HADDR[31]}]
set_input_transition -min 0.0400 [get_ports {HADDR[30]}]
set_input_transition -max 0.6700 [get_ports {HADDR[30]}]
set_input_transition -min 0.0400 [get_ports {HADDR[29]}]
set_input_transition -max 0.6700 [get_ports {HADDR[29]}]
set_input_transition -min 0.0400 [get_ports {HADDR[28]}]
set_input_transition -max 0.6700 [get_ports {HADDR[28]}]
set_input_transition -min 0.0400 [get_ports {HADDR[27]}]
set_input_transition -max 0.6700 [get_ports {HADDR[27]}]
set_input_transition -min 0.0400 [get_ports {HADDR[26]}]
set_input_transition -max 0.6700 [get_ports {HADDR[26]}]
set_input_transition -min 0.0400 [get_ports {HADDR[25]}]
set_input_transition -max 0.6700 [get_ports {HADDR[25]}]
set_input_transition -min 0.0400 [get_ports {HADDR[24]}]
set_input_transition -max 0.6700 [get_ports {HADDR[24]}]
set_input_transition -min 0.0400 [get_ports {HADDR[23]}]
set_input_transition -max 0.6700 [get_ports {HADDR[23]}]
set_input_transition -min 0.0400 [get_ports {HADDR[22]}]
set_input_transition -max 0.6700 [get_ports {HADDR[22]}]
set_input_transition -min 0.0400 [get_ports {HADDR[21]}]
set_input_transition -max 0.6700 [get_ports {HADDR[21]}]
set_input_transition -min 0.0400 [get_ports {HADDR[20]}]
set_input_transition -max 0.6700 [get_ports {HADDR[20]}]
set_input_transition -min 0.0400 [get_ports {HADDR[19]}]
set_input_transition -max 0.6700 [get_ports {HADDR[19]}]
set_input_transition -min 0.0400 [get_ports {HADDR[18]}]
set_input_transition -max 0.6700 [get_ports {HADDR[18]}]
set_input_transition -min 0.0400 [get_ports {HADDR[17]}]
set_input_transition -max 0.6700 [get_ports {HADDR[17]}]
set_input_transition -min 0.0400 [get_ports {HADDR[16]}]
set_input_transition -max 0.6700 [get_ports {HADDR[16]}]
set_input_transition -min 0.0400 [get_ports {HADDR[15]}]
set_input_transition -max 0.6700 [get_ports {HADDR[15]}]
set_input_transition -min 0.0400 [get_ports {HADDR[14]}]
set_input_transition -max 0.6700 [get_ports {HADDR[14]}]
set_input_transition -min 0.0400 [get_ports {HADDR[13]}]
set_input_transition -max 0.6700 [get_ports {HADDR[13]}]
set_input_transition -min 0.0400 [get_ports {HADDR[12]}]
set_input_transition -max 0.6700 [get_ports {HADDR[12]}]
set_input_transition -min 0.0400 [get_ports {HADDR[11]}]
set_input_transition -max 0.6700 [get_ports {HADDR[11]}]
set_input_transition -min 0.0400 [get_ports {HADDR[10]}]
set_input_transition -max 0.6700 [get_ports {HADDR[10]}]
set_input_transition -min 0.0400 [get_ports {HADDR[9]}]
set_input_transition -max 0.6700 [get_ports {HADDR[9]}]
set_input_transition -min 0.0400 [get_ports {HADDR[8]}]
set_input_transition -max 0.6700 [get_ports {HADDR[8]}]
set_input_transition -min 0.0400 [get_ports {HADDR[7]}]
set_input_transition -max 0.6700 [get_ports {HADDR[7]}]
set_input_transition -min 0.0400 [get_ports {HADDR[6]}]
set_input_transition -max 0.6700 [get_ports {HADDR[6]}]
set_input_transition -min 0.0400 [get_ports {HADDR[5]}]
set_input_transition -max 0.6700 [get_ports {HADDR[5]}]
set_input_transition -min 0.0400 [get_ports {HADDR[4]}]
set_input_transition -max 0.6700 [get_ports {HADDR[4]}]
set_input_transition -min 0.0400 [get_ports {HADDR[3]}]
set_input_transition -max 0.6700 [get_ports {HADDR[3]}]
set_input_transition -min 0.0400 [get_ports {HADDR[2]}]
set_input_transition -max 0.6700 [get_ports {HADDR[2]}]
set_input_transition -min 0.0400 [get_ports {HADDR[1]}]
set_input_transition -max 0.6700 [get_ports {HADDR[1]}]
set_input_transition -min 0.0400 [get_ports {HADDR[0]}]
set_input_transition -max 0.6700 [get_ports {HADDR[0]}]
set_input_transition 0.1200 [get_ports {HSIZE[2]}]
set_input_transition 0.1200 [get_ports {HSIZE[1]}]
set_input_transition 0.1200 [get_ports {HSIZE[0]}]
set_input_transition 0.3200 [get_ports {HTRANS[1]}]
set_input_transition 0.3200 [get_ports {HTRANS[0]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[31]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[31]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[30]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[30]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[29]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[29]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[28]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[28]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[27]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[27]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[26]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[26]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[25]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[25]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[24]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[24]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[23]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[23]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[22]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[22]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[21]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[21]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[20]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[20]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[19]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[19]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[18]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[18]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[17]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[17]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[16]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[16]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[15]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[15]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[14]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[14]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[13]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[13]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[12]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[12]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[11]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[11]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[10]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[10]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[9]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[9]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[8]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[8]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[7]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[7]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[6]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[6]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[5]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[5]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[4]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[4]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[3]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[3]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[2]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[2]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[1]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[1]}]
set_input_transition -min 0.0400 [get_ports {HWDATA[0]}]
set_input_transition -max 0.4900 [get_ports {HWDATA[0]}]
set_input_transition 0.1100 [get_ports {gpio0_in[7]}]
set_input_transition 0.1100 [get_ports {gpio0_in[6]}]
set_input_transition 0.1100 [get_ports {gpio0_in[5]}]
set_input_transition 0.1100 [get_ports {gpio0_in[4]}]
set_input_transition 0.1100 [get_ports {gpio0_in[3]}]
set_input_transition 0.1100 [get_ports {gpio0_in[2]}]
set_input_transition 0.1100 [get_ports {gpio0_in[1]}]
set_input_transition 0.1100 [get_ports {gpio0_in[0]}]
set_input_transition -min 0.0500 [get_ports {gpio1_in[7]}]
set_input_transition -max 0.0800 [get_ports {gpio1_in[7]}]
set_input_transition -min 0.0500 [get_ports {gpio1_in[6]}]
set_input_transition -max 0.0800 [get_ports {gpio1_in[6]}]
set_input_transition -min 0.0500 [get_ports {gpio1_in[5]}]
set_input_transition -max 0.0800 [get_ports {gpio1_in[5]}]
set_input_transition -min 0.0500 [get_ports {gpio1_in[4]}]
set_input_transition -max 0.0800 [get_ports {gpio1_in[4]}]
set_input_transition -min 0.0500 [get_ports {gpio1_in[3]}]
set_input_transition -max 0.0800 [get_ports {gpio1_in[3]}]
set_input_transition -min 0.0500 [get_ports {gpio1_in[2]}]
set_input_transition -max 0.0800 [get_ports {gpio1_in[2]}]
set_input_transition -min 0.0500 [get_ports {gpio1_in[1]}]
set_input_transition -max 0.0800 [get_ports {gpio1_in[1]}]
set_input_transition -min 0.0500 [get_ports {gpio1_in[0]}]
set_input_transition -max 0.0800 [get_ports {gpio1_in[0]}]
set_input_transition 0.1400 [get_ports {gpio2_in[7]}]
set_input_transition 0.1400 [get_ports {gpio2_in[6]}]
set_input_transition 0.1400 [get_ports {gpio2_in[5]}]
set_input_transition 0.1400 [get_ports {gpio2_in[4]}]
set_input_transition 0.1400 [get_ports {gpio2_in[3]}]
set_input_transition 0.1400 [get_ports {gpio2_in[2]}]
set_input_transition 0.1400 [get_ports {gpio2_in[1]}]
set_input_transition 0.1400 [get_ports {gpio2_in[0]}]
set_input_transition -min 0.0600 [get_ports {gpio3_in[7]}]
set_input_transition -max 0.1000 [get_ports {gpio3_in[7]}]
set_input_transition -min 0.0600 [get_ports {gpio3_in[6]}]
set_input_transition -max 0.1000 [get_ports {gpio3_in[6]}]
set_input_transition -min 0.0600 [get_ports {gpio3_in[5]}]
set_input_transition -max 0.1000 [get_ports {gpio3_in[5]}]
set_input_transition -min 0.0600 [get_ports {gpio3_in[4]}]
set_input_transition -max 0.1000 [get_ports {gpio3_in[4]}]
set_input_transition -min 0.0600 [get_ports {gpio3_in[3]}]
set_input_transition -max 0.1000 [get_ports {gpio3_in[3]}]
set_input_transition -min 0.0600 [get_ports {gpio3_in[2]}]
set_input_transition -max 0.1000 [get_ports {gpio3_in[2]}]
set_input_transition -min 0.0600 [get_ports {gpio3_in[1]}]
set_input_transition -max 0.1000 [get_ports {gpio3_in[1]}]
set_input_transition -min 0.0600 [get_ports {gpio3_in[0]}]
set_input_transition -max 0.1000 [get_ports {gpio3_in[0]}]
set_input_transition -min 0.0900 [get_ports {gpio4_in[7]}]
set_input_transition -max 0.1000 [get_ports {gpio4_in[7]}]
set_input_transition -min 0.0900 [get_ports {gpio4_in[6]}]
set_input_transition -max 0.1000 [get_ports {gpio4_in[6]}]
set_input_transition -min 0.0900 [get_ports {gpio4_in[5]}]
set_input_transition -max 0.1000 [get_ports {gpio4_in[5]}]
set_input_transition -min 0.0900 [get_ports {gpio4_in[4]}]
set_input_transition -max 0.1000 [get_ports {gpio4_in[4]}]
set_input_transition -min 0.0900 [get_ports {gpio4_in[3]}]
set_input_transition -max 0.1000 [get_ports {gpio4_in[3]}]
set_input_transition -min 0.0900 [get_ports {gpio4_in[2]}]
set_input_transition -max 0.1000 [get_ports {gpio4_in[2]}]
set_input_transition -min 0.0900 [get_ports {gpio4_in[1]}]
set_input_transition -max 0.1000 [get_ports {gpio4_in[1]}]
set_input_transition -min 0.0900 [get_ports {gpio4_in[0]}]
set_input_transition -max 0.1000 [get_ports {gpio4_in[0]}]
set_input_transition 0.1400 [get_ports {gpio5_in[7]}]
set_input_transition 0.1400 [get_ports {gpio5_in[6]}]
set_input_transition 0.1400 [get_ports {gpio5_in[5]}]
set_input_transition 0.1400 [get_ports {gpio5_in[4]}]
set_input_transition 0.1400 [get_ports {gpio5_in[3]}]
set_input_transition 0.1400 [get_ports {gpio5_in[2]}]
set_input_transition 0.1400 [get_ports {gpio5_in[1]}]
set_input_transition 0.1400 [get_ports {gpio5_in[0]}]
set_input_transition -min 0.0500 [get_ports {gpio6_in[7]}]
set_input_transition -max 0.0800 [get_ports {gpio6_in[7]}]
set_input_transition -min 0.0500 [get_ports {gpio6_in[6]}]
set_input_transition -max 0.0800 [get_ports {gpio6_in[6]}]
set_input_transition -min 0.0500 [get_ports {gpio6_in[5]}]
set_input_transition -max 0.0800 [get_ports {gpio6_in[5]}]
set_input_transition -min 0.0500 [get_ports {gpio6_in[4]}]
set_input_transition -max 0.0800 [get_ports {gpio6_in[4]}]
set_input_transition -min 0.0500 [get_ports {gpio6_in[3]}]
set_input_transition -max 0.0800 [get_ports {gpio6_in[3]}]
set_input_transition -min 0.0500 [get_ports {gpio6_in[2]}]
set_input_transition -max 0.0800 [get_ports {gpio6_in[2]}]
set_input_transition -min 0.0500 [get_ports {gpio6_in[1]}]
set_input_transition -max 0.0800 [get_ports {gpio6_in[1]}]
set_input_transition -min 0.0500 [get_ports {gpio6_in[0]}]
set_input_transition -max 0.0800 [get_ports {gpio6_in[0]}]
set_input_transition -min 0.0300 [get_ports {gpio7_in[7]}]
set_input_transition -max 0.0900 [get_ports {gpio7_in[7]}]
set_input_transition -min 0.0300 [get_ports {gpio7_in[6]}]
set_input_transition -max 0.0900 [get_ports {gpio7_in[6]}]
set_input_transition -min 0.0300 [get_ports {gpio7_in[5]}]
set_input_transition -max 0.0900 [get_ports {gpio7_in[5]}]
set_input_transition -min 0.0300 [get_ports {gpio7_in[4]}]
set_input_transition -max 0.0900 [get_ports {gpio7_in[4]}]
set_input_transition -min 0.0300 [get_ports {gpio7_in[3]}]
set_input_transition -max 0.0900 [get_ports {gpio7_in[3]}]
set_input_transition -min 0.0300 [get_ports {gpio7_in[2]}]
set_input_transition -max 0.0900 [get_ports {gpio7_in[2]}]
set_input_transition -min 0.0300 [get_ports {gpio7_in[1]}]
set_input_transition -max 0.0900 [get_ports {gpio7_in[1]}]
set_input_transition -min 0.0300 [get_ports {gpio7_in[0]}]
set_input_transition -max 0.0900 [get_ports {gpio7_in[0]}]
set_input_transition 0.1700 [get_ports {sio_in[1]}]
set_input_transition 0.1700 [get_ports {sio_in[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
